#include "InvoiceXML.h"
#include <stdexcept>

const InvoiceRecipient recipients[28]
/*{
	{"01",u8"РЗОК Благоевград","гр. Благоевград, пл. “Георги Измирлиев” 9","1218582201431"},
	{"02",u8"РЗОК Бургас","гр. Бургас, Парк “Езеро”","1218582201446"},
	{"03",u8"РЗОК Варна","гр. Варна, бул. “Цар Освободител” 76-Г","1218582201450"},
	{"04",u8"РЗОК Велико Търново","гр. Велико Търново, ул. “Ивайло” 2","1218582201465"},
	{"05",u8"РЗОК Видин","гр. Видин, бул. “Панония” 2","1218582201471"},
	{"06",u8"РЗОК Враца","гр. Враца, ул. “Иваница Данчов” 2","1218582201484"},
	{"07",u8"РЗОК Габрово","гр. Габрово, ул.“Отец Паисий” 25","1218582201499"},
	{"08",u8"РЗОК Добрич","гр. Добрич, ул. “Независимост” 5, ет. 4","1218582201656"},
	{"09",u8"РЗОК Кърджали","гр. Кърджали, бул. “Тракия” 19","1218582200015"},
	{"10",u8"РЗОК Кюстендил","гр. Кюстендил, ул. “Демокрация” 44, вх. Б","1218582201515"},
	{"11",u8"РЗОК Ловеч","гр. Ловеч, ул. “Кубрат” 7","1218582201524"},
	{"12",u8"РЗОК Монтана","гр. Монтана, бул. “Трети март” 41","1218582201534"},
	{"13",u8"РЗОК Пазарджик","гр. Пазарджик, ул. “11 август” 2","1218582201549"},
	{"14",u8"РЗОК Перник","гр. Перник, пл. “Кракра Пернишки” 2, ет. 6","1218582201553"},
	{"15",u8"РЗОК Плевен","гр. Плевен, ул. “Княз Александър Батенберг I” 7","1218582201568"},
	{"16",u8"РЗОК Пловдив","гр. Пловдив, ул. “Христо Чернопеев” 14","1218582201572"},
	{"17",u8"РЗОК Разград","гр. Разград, бул. “България” 36","1218582200023"},
	{"18",u8"РЗОК Русе","гр. Русе, ул. “Райко Даскалов” 16","1218582201587"},
	{"19",u8"РЗОК Силистра","гр. Силистра, ул. “Партений Павлович” 3","1218582201618"},
	{"20",u8"РЗОК Сливен","гр. Сливен, ул. „Самуил” 1, НТС, ет. 4 - ет. 8","1218582201603"},
	{"21",u8"РЗОК Смолян","гр. Смолян, бул. “България” 7","1218582201591"},
	{"22",u8"СЗОК","гр. София, ул. “Енос” 10, вх. Б","1218582201412"},
	{"23",u8"РЗОК София - област","гр. София, ул. “Енос” 10, вх. Б","1218582201427"},
	{"24",u8"РЗОК Стара Загора","гр. Стара Загора, ул. “Цар Иван Шишман” 54А","1218582201622"},
	{"25",u8"РЗОК Търговище","гр. Търговище, ул. “Трайко Китанчев” 37","1218582201637"},
	{"26",u8"РЗОК Хасково","гр. Хасково, пл. “Градска болница” 1","1218582201675"},
	{"27",u8"РЗОК Шумен","гр. Шумен, ул. “Цар Освободител” 102","1218582201641"},
	{"28",u8"РЗОК Ямбол","гр. Ямбол, ул. “Д-р П. Брънеков” 1","1218582201660"}
}
*/
;

const std::string_view insuranceFunds[46]
{
"NONE",
"NZOK",
"MZ",
"NZOK",
"MZ",
"NZOK",
"NZOK",
"NZOK",
"NZOK",
"MZ",
"MZ",
"MZ",
"NZOK",
"NZOK",
"MZ",
"MZ",
"NZOK",
"NZOK",
"MZ",
"NZOK",
"NZOK",
"MZ",
"ASP",
"ASP",
"NZOK",
"NZOK",
"MZ",
"MZ",
"MZ",
"MZ",
"MZ",
"NZOK",
"NZOK",
"NZOK",
"MZ",
"NZOK",
"ASP",
"MZ",
"NZOK",
"MZ",
"NZOK",
"MZ",
"NZOK",
"MZ",
"NZOK",
"MZ"
};



const InvoiceRecipient& getRecipient(const std::string& RHIF)
{
	int idx = std::stoi(RHIF);
	if(idx > 28 || idx < 1)
		throw std::invalid_argument("Invalid RHIF");

	return recipients[idx];
}

std::string getInsuranceFund(int activityTypeCode)
{
	if(activityTypeCode < 1 || activityTypeCode > 45)
		throw std::invalid_argument("Invalid activityCode");

	return insuranceFunds[activityTypeCode].data();
}
