#include "Recipient.h"
#include "Model/UserStructs.h"
#include "Model/Patient.h"
#include <array>


constexpr int nhifRecipientCount = 30;

std::array<Recipient, nhifRecipientCount> nhifRecipients
{ {
    {
        "ЦУ на НЗОК", 
        "гр. София, ул. “Кричим” 1", 
        "121858220", 
        "029659387"
    },
    {
        "РЗОК Благоевград",
        "гр. Благоевград, пл. “Георги Измирлиев” 9",
        "1218582201431",
        "07388300475"
    },
    {
        "РЗОК Бургас",
        "гр. Бургас, Парк “Езеро”",
        "1218582201446",
        "056806666"
    },
    {
        "РЗОК Варна",
        "гр. Варна, бул. “Цар Освободител” 76-Г",
        "1218582201450",
        "052689072"
    },
    {
        "РЗОК Велико Търново",
        "гр. Велико Търново, ул. “Ивайло” 2",
        "1218582201465",
        "062611252"

    },
    {
        "РЗОК Видин",
        "гр. Видин, бул. “Панония” 2",
        "1218582201471",
        "094609810"
      
    },
    {
        "РЗОК Враца",
        "гр. Враца, ул. “Иваница Данчов” 2",
        "1218582201484",
        "092686110"

    },
    {
        "РЗОК Габрово",
        "гр. Габрово, ул.“Отец Паисий” 25",
        "1218582201499",
        "066819523"
    },
    {
        "РЗОК Добрич",
        "гр. Добрич, ул. “Независимост” 5, ет. 4",
        "1218582201656",
        "058654500"
    },
    {
        "РЗОК Кърджали",
        "гр. Кърджали, бул. “Тракия” 19",
        "1218582200015",
        "036163514"
    },
    {
        "РЗОК Кюстендил",
        "гр. Кюстендил, ул. “Демокрация” 44, вх. Б",
        "1218582201515",
        "078559700"
    },
    {
        "РЗОК Ловеч",
        "гр. Ловеч, ул. “Кубрат” 7",
        "1218582201524",
        "068688105"
    },
    {
        "РЗОК Монтана",
        "гр. Монтана, бул. “Трети март” 41",
        "1218582201534",
        "096396110"
    },
    {
        "РЗОК Пазарджик",
        "гр. Пазарджик, ул. “11 август” 2",
        "1218582201549",
        "034402105"
    },
    {
        "РЗОК Перник",
        "гр. Перник, пл. “Кракра Пернишки” 2, ет. 6",
        "1218582201553",
        "076649210"
    },
    {
        "РЗОК Плевен",
        "гр. Плевен, ул. “Княз Александър Батенберг I” 7",
        "1218582201568",
        "064882511"
    },
    {
        "РЗОК Пловдив",
        "гр. Пловдив, ул. “Христо Чернопеев” 14",
        "1218582201572",
        "032603011"

    },
    {
        "РЗОК Разград",
        "гр. Разград, бул. “България” 36",
        "1218582200023",
        "084611558"
    },
    {
        "РЗОК Русе",
        "гр. Русе, ул. “Райко Даскалов” 16",
        "1218582201587",
        "082886173"
    },
    {
        "РЗОК Силистра",
        "гр. Силистра, ул. “Партений Павлович” 3",
        "1218582201618",
        "086812144"
    },
    {
        "РЗОК Сливен",
        "гр. Сливен, ул. „Самуил” 1, НТС, ет. 4 - ет. 8",
        "1218582201603",
        "044615201"
    },
    {
        "РЗОК Смолян",
        "гр. Смолян, бул. “България” 7",
        "1218582201591",
        "030167044"
    },
    {
        "СЗОК",
        "гр. София, ул. “Енос” 10, вх. Б",
        "1218582201412",
        "029656746"
    },
    {
        "РЗОК София - област",
        "гр. София, ул. “Енос” 10, вх. Б",
        "1218582201427",
        "029656943"
    },
    {
        "РЗОК Стара Загора",
        "гр. Стара Загора, ул. “Цар Иван Шишман” 54А",
        "1218582201622",
        "042610977"
    },
    {
        "РЗОК Търговище",
        "гр. Търговище, ул. “Трайко Китанчев” 37",
        "1218582201637",
        "060161102"

    },
    {
        "РЗОК Хасково",
        "гр. Хасково, пл. “Градска болница” 1",
        "1218582201675",
        "038607311"
    },
    {
        "РЗОК Шумен",
        "гр. Шумен, ул. “Цар Освободител” 102",
        "1218582201641",
        "054850085"
    },
    {
        "РЗОК Ямбол",
        "гр. Ямбол, ул. “Д-р П. Брънеков” 1",
        "1218582201660",
        "046685011"
    },
    {
        "???","???","???","???"
    }

} };

const Recipient& getRecipient(const Practice& p) {

    if (!p.nhif_contract) return nhifRecipients[29];

    int idx = std::stoi(p.nhif_contract->contract_no.substr(0, 2));

    return nhifRecipients[idx];
}

Recipient::Recipient(const Practice& p) : Recipient(getRecipient(p))
{}

Recipient::Recipient(const Patient& patient) :
    name{ patient.fullName() } ,
    address{ patient.getFullAddress() },
    bulstat{ patient.id },
    phone {patient.phone}
{}

bool Recipient::isNhifBulstat(const std::string & bulstat)
{
    for (auto& r : nhifRecipients) { if (r.bulstat == bulstat) return true; }

    return false;
}
