#include "Recipient.h"
#include "Model/Patient.h"
#include <array>


constexpr int nzokRecipientCount = 28;

std::array<Recipient, nzokRecipientCount> nzokRecipients
{ {
    {
        u8"РЗОК Благоевград",
        u8"гр. Благоевград, пл. “Георги Измирлиев” 9",
        "1218582201431",
        "073 8830 0475"
    },
    {
        u8"РЗОК Бургас",
        u8"гр. Бургас, Парк “Езеро”",
        "1218582201446",
        "056 806 666"
    },
    {
        u8"РЗОК Варна",
        u8"гр. Варна, бул. “Цар Освободител” 76-Г",
        "1218582201450",
        "052 689 072"
    },
    {
        u8"РЗОК Велико Търново",
        u8"гр. Велико Търново, ул. “Ивайло” 2",
        "1218582201465",
        "062 611 252"

    },
    {
        u8"РЗОК Видин",
        u8"гр. Видин, бул. “Панония” 2",
        "1218582201471",
        "094 609 810"
      
    },
    {
        u8"РЗОК Враца",
        u8"гр. Враца, ул. “Иваница Данчов” 2",
        "1218582201484",
        "092 686 110"

    },
    {
        u8"РЗОК Габрово",
        u8"гр. Габрово, ул.“Отец Паисий” 25",
        "1218582201499",
        "066 819 523"
    },
    {
        u8"РЗОК Добрич",
        u8"гр. Добрич, ул. “Независимост” 5, ет. 4",
        "1218582201656",
        "058 654 500"
    },
    {
        u8"РЗОК Кърджали",
        u8"гр. Кърджали, бул. “Тракия” 19",
        "1218582200015",
        "036 163 514"
    },
    {
        u8"РЗОК Кюстендил",
        u8"гр. Кюстендил, ул. “Демокрация” 44, вх. Б",
        "1218582201515",
        "078 559 700"
    },
    {
        u8"РЗОК Ловеч",
        u8"гр. Ловеч, ул. “Кубрат” 7",
        "1218582201524",
        "068 688 105"
    },
    {
        u8"РЗОК Монтана",
        u8"гр. Монтана, бул. “Трети март” 41",
        "1218582201534",
        "096 396 110"
    },
    {
        u8"РЗОК Пазарджик",
        u8"гр. Пазарджик, ул. “11 август” 2",
        "1218582201549",
        "034 402 105"
    },
    {
        u8"РЗОК Перник",
        u8"гр. Перник, пл. “Кракра Пернишки” 2, ет. 6",
        "1218582201553",
        "076 649 210"
    },
    {
        u8"РЗОК Плевен",
        u8"гр. Плевен, ул. “Княз Александър Батенберг I” 7",
        "1218582201568",
        "064 882 511"
    },
    {
        u8"РЗОК Пловдив",
        u8"гр. Пловдив, ул. “Христо Чернопеев” 14",
        "1218582201572",
        "032 603 011"

    },
    {
        u8"РЗОК Разград",
        u8"гр. Разград, бул. “България” 36",
        "1218582200023",
        "084 611 558"
    },
    {
        u8"РЗОК Русе",
        u8"гр. Русе, ул. “Райко Даскалов” 16",
        "1218582201587",
        "082 886 173"
    },
    {
        u8"РЗОК Силистра",
        u8"гр. Силистра, ул. “Партений Павлович” 3",
        "1218582201618",
        "086 812 144"
    },
    {
        u8"РЗОК Сливен",
        u8"гр. Сливен, ул. „Самуил” 1, НТС, ет. 4 - ет. 8",
        "1218582201603",
        "044 615 201"
    },
    {
        u8"РЗОК Смолян",
        u8"гр. Смолян, бул. “България” 7",
        "1218582201591",
        "0301 67044"
    },
    {
        u8"СЗОК",
        u8"гр. София, ул. “Енос” 10, вх. Б",
        "1218582201412",
        "02 965 67 46"
    },
    {
        u8"РЗОК София - област",
        u8"гр. София, ул. “Енос” 10, вх. Б",
        "1218582201427",
        "02 965 69 43"
    },
    {
        u8"РЗОК Стара Загора",
        u8"гр. Стара Загора, ул. “Цар Иван Шишман” 54А",
        "1218582201622",
        "042 61 09 77"
    },
    {
        u8"РЗОК Търговище",
        u8"гр. Търговище, ул. “Трайко Китанчев” 37",
        "1218582201637",
        "0601 61102"

    },
    {
        u8"РЗОК Хасково",
        u8"гр. Хасково, пл. “Градска болница” 1",
        "1218582201675",
        "038 60 73 11"
    },
    {
        u8"РЗОК Шумен",
        u8"гр. Шумен, ул. “Цар Освободител” 102",
        "1218582201641",
        "054 85 00 85"
    },
    {
        u8"РЗОК Ямбол",
        u8"гр. Ямбол, ул. “Д-р П. Брънеков” 1",
        "1218582201660",
        "046 68 50 11"
    }
} };

const Recipient& getRecipient(int practiceRhif) {
    if (practiceRhif < 1 || practiceRhif > nzokRecipientCount)
        throw std::exception("Invalid RHIF");

    return nzokRecipients[practiceRhif - 1];
}

Recipient::Recipient(int practiceRhif) : Recipient(getRecipient(practiceRhif))
{}

Recipient::Recipient(const Patient& patient) :
    name{ patient.fullName() } ,
    address{ patient.getFullAddress() },
    bulstat{ patient.id },
    phone {patient.phone}
{}