#pragma once

#include <string>
#include <vector>
#include <optional>
#include <map>

#include "Model/Date.h"
#include "Model/Dental/Diagnosis.h"
#include "Model/Ekatte.h"

struct SickLeave
{
    inline static const std::map<int, std::string> regimes{
        // {1, "Болничен"},
        {2, "Домашен — на легло постоянно или за определени часове от деня"},
        {3, "Домашен — стаен"},
        {4, "Домашен — амбулаторен"},
        {5, "Санаторно-курортен"},
        {6, "Свободен без право да напуска населеното място"},
        {7, "Свободен с право да напуска населеното място в рамките на РБ"}
    };

    inline static const std::map<int, std::string> reasons{
        {1, "Общо заболяване"},
        {2, "Професионална болест"},
        {4, "Злополука — трудова по чл. 55, ал. 1 от КСО"},
        {5, "Злополука — трудова по чл. 55, ал. 2 от КСО"},
        {6, "Злополука — нетрудова"},
        // {7, "Изследване поради общо заболяване"},
        // {8, "Изследване поради трудова злополука по чл. 55, ал. 1 от КСО"},
        // {9, "Изследване поради трудова злополука по чл. 55, ал. 2 от КСО"},
        // {10, "Изследване поради професионална болест"},
        // {11, "Бацило-/паразитоносителство"},
        // {12, "Карантина"},
        // {13, "Аборт"},
        // {14, "Бременност"},
        // {15, "Майчинство"},
        // {16, "Трудоустрояване — общо заболяване"},
        // {17, "Трудоустрояване — трудова злополука по чл. 55, ал. 1 от КСО"},
        // {18, "Трудоустрояване — трудова злополука по чл. 55, ал. 2 от КСО"},
        // {19, "Трудоустрояване — професионална болест"},
        // {20, "Трудоустрояване — бременност"},
        // {21, "Санаторно-курортно лечение поради общо заболяване"},
        // {22, "Санаторно-курортно лечение поради трудова злополука по чл. 55, ал. 1 от КСО"},
        // {23, "Санаторно-курортно лечение поради трудова злополука по чл. 55, ал. 2 от КСО"},
        // {24, "Санаторно-курортно лечение поради професионална болест"},
        // {25, "Придружаване на дете до 3-годишна възраст в болнично заведение"},
        {26, "Придружаване и гледане на дете до 18-годишна възраст"},
        {27, "Придружаване и гледане на болен над 18-годишна възраст"}
    };

    inline static const std::map<int, std::string> notes{
        {0, "Няма"},
        // {1, "Заразна болест"},
        {2, "Болничният лист се издава за повече от един работодател/осигурител"},
        // {3, "За анкета"},
        {4, "Разрешава се ползването на домашния отпуск в друго населено място"},
        // {5, "Гледане на болно дете до 3-годишна възраст в лечебно заведение за болнична помощ"},
        {6, "За доказване с разпореждане на ТП на НОИ — при съмнение за трудова злополука"},
        {7, "За доказване с експертно решение на ТЕЛК — при съмнение за професионална болест"},
        // {8, "При трудоустрояване се посочва работното място или длъжността/изискванията към работното място или длъжността"},
        {9, "Издава се за минало време"},
        {10, "Гледане на болен член от семейството у дома"},
        {11, "За придружаване на член от семейството за консултация и изследване"},
        {13, "За гледане на дете по чл. 167 КТ"},
        // {14, "Издава се за лечение/изследване в чужбина"},
        // {15, "Издава се за раждане в чужбина"},
        {16, "Издава се на лице, осигурено по законодателството на друга държава"},
        // {17, "За гледане на дете под карантина"},
        // {18, "Гледане на болен член от семейството в лечебно заведение за болнична помощ по заключение от ръководителя на лечебното заведение"},
        // {19, "Неработоспособността на майката е вследствие на раждането"},
        {20, "Други"},
        {21, "За гледане на дете по чл. 163, ал. 7 КТ"}
    };

    long long rowid{ 0 };

    std::string number;
    Date date{ Date::currentDate() };

	bool isContinuation{ false };

    int regimeType{ 4 };

    std::string medicalExamNumber; //nrn

    Date startDate = Date::currentDate();
    Date endDate = Date::currentDate(); // Inclusive

    Diagnosis diagnosis;

    int reasonCode{ 1 };

    std::string employerName;
    Ekatte employerCity;
    std::string profession;
    std::string position;

    std::optional<Date> medicalCheckDate; //followup

    int noteCode;
    std::string additionalNote;

    bool isCancelled = false;

};