#pragma once

#include <string>
#include <vector>
#include <optional>
#include <map>

#include "Model/Date.h"
#include "Model/Dental/Diagnosis.h"

struct SickLeave
{
    inline static const std::map<int, std::string> regimens{
        {2, "Домашен — на легло постоянно или за определени часове от деня"},
        {3, "Домашен — стаен"},
        {4, "Домашен — амбулаторен"},
        {5, "Санаторно-курортен"},
        {6, "Свободен без право да напуска населеното място"},
        {7, "Свободен с право да напуска населеното място в рамките на РБ"}
    };

    inline static const std::map<int, std::string> reasons{
        {1, "Общо заболяване"},
        {2, "Професионална болест"},
        {4, "Злополука — трудова по чл. 55, ал. 1 от КСО"},
        {5, "Злополука — трудова по чл. 55, ал. 2 от КСО"},
        {6, "Злополука — нетрудова"},
        {26, "Придружаване и гледане на дете до 18-годишна възраст"},
        {27, "Придружаване и гледане на болен над 18-годишна възраст"}
    };

    inline static const std::map<int, std::string> notes{
        {1, "Заразна болест"},
        {2, "Болничният лист се издава за повече от един работодател/осигурител"},
        {4, "Разрешава се ползването на домашния отпуск в друго населено място"},
        {6, "За доказване с разпореждане на ТП на НОИ — при съмнение за трудова злополука"},
        {7, "За доказване с експертно решение на ТЕЛК — при съмнение за професионална болест"},
        {8, "При трудоустрояване се посочва работното място или длъжността/"
            "изискванията към работното място или длъжността"},
        {9, "Издава се за минало време"},
        {10, "Гледане на болен член от семейството у дома"},
        {11, "За придружаване на член от семейството за консултация и изследване"},
        {13, "За гледане на дете по чл. 167 КТ"},
        {16, "Издава се на лице, осигурено по законодателството на друга държава"},
        {20, "Други"},
        {21, "За гледане на дете по чл. 163, ал. 7 КТ"}
    };

    long long rowid{ 0 };

    std::string number;
    Date date{ Date::currentDate() };

	bool isContinuation{ false };

    int regimeType{ 4 };

    int days{ 0 };

    std::string medicalExamNumber; //nrn

    Date startDate;
    Date endDate; // Inclusive

    Diagnosis diagnosis;

    int reasonCode{ 1 };

    std::optional<Date> medicalCheckDate; //followup

    std::vector<int> noteCodes;
    std::string additionalNote;

    bool isCancelled = false;

};