#include "RefNum.h"

std::array<const char*, 2> RefNumPrv::reason =
{
//	"",
	"Остро заболяване или състояние извън останалите типове",
	"Хронично заболяване, неподлежащо на диспансерно наблюдение"
//	"Избор на специалист за диспансерно наблюдение"
//	"Диспансерно наблюдение"
//	"Медицинска експертиза"
//	"Профилактика нa пълнолетни лица"
//	"По искане на ТЕЛК(НЕЛК)"
//	"Избор на специалист за майчино здравеопазване"
//	"Избор на специалист за детско здравеопазване"
//	"Преизбор на специалист за майчино здравеопазване"
//	"Преизбор на специалист за детско здравеопазване"
//	"Подготовка за ТЕЛК"
};

std::array<const char*, 4> RefNumPrv::MH119_reason =
{
	"Изследване",
	"Консултация",
	"Болнично лечение",
	"Санаториално лечение"
};